orgs/Slurm-Config-Use.org
#+title: Slurm's Configuration and Usage
#+date: Wed Sep  3 16:34:48 2025
#+author: Zi Liang
#+email: zi1415926.liang@connect.polyu.hk
#+latex_class: elegantpaper
#+filetags: ::




* Configuration

#+begin_src sh

## 1. Install
sudo apt install -y munge libmunge-dev gcc make perl \
sqlite3 libsqlite3-dev libssl-dev

sudo apt install -y slurm-wlm slurm-wlm-doc

slurmd --version   

## 2. Config Munge
# gen key
sudo /usr/sbin/create-munge-key -r
sudo chown munge:munge /etc/munge/munge.key
sudo chmod 400 /etc/munge/munge.key
sudo systemctl enable --now munge

## 3. Config slurm.conf
sudo mkdir -p /etc/slurm
sudo vim /etc/slurm/slurm.conf
#+end_src

Add the configuration of slurm.conf:

#+begin_src bash
# ===GLOBAL ===
ClusterName=gs14
ControlMachine=gs14
MpiDefault=none
# === NODES DEF===
NodeName=gs14 CPUs=192 Boards=1 SocketsPerBoard=2 CoresPerSocket=48 ThreadsPerCore=2 RealMemory=501000 Gres=gpu:6 State=UNKNOWN
# ===QUEUE===
PartitionName=gpu Nodes=gs14 Default=YES MaxTime=7-00:00:00 State=UP
# === ACCOUNT==
AccountingStorageType=accounting_storage/none
SelectType=select/cons_res
SelectTypeParameters=CR_Core_Memory
TaskPlugin=task/none
ProctrackType=proctrack/linuxproc
GresTypes=gpu
#+end_src

Add the conf for GPU resources:

#+begin_src sh
  sudo vim /etc/slurm/gres.conf
#+end_src

  fill in:

#+begin_src bash
NodeName=gs14 Name=gpu File=/dev/nvidia0
NodeName=gs14 Name=gpu File=/dev/nvidia1
NodeName=gs14 Name=gpu File=/dev/nvidia2
NodeName=gs14 Name=gpu File=/dev/nvidia3
NodeName=gs14 Name=gpu File=/dev/nvidia4
NodeName=gs14 Name=gpu File=/dev/nvidia5
#+end_src
Restart Service:

#+begin_src bash
sudo systemctl enable --now slurmctld
sudo systemctl enable --now slurmd
sinfo
#+end_src

* Usage

** Introduction to Slurm for AI Model Training
This document provides a comprehensive guide to Slurm, a popular workload manager used in high-performance computing (HPC) environments. It is particularly useful for training AI models on clusters with multiple nodes and GPUs. We'll cover what Slurm is, its key concepts, basic usage, and advanced features tailored for AI workloads like deep learning training with frameworks such as PyTorch or TensorFlow.

The guide assumes you have access to a Linux-based HPC cluster where Slurm is installed (common in universities, research labs, or cloud providers like AWS ParallelCluster). If you're new to HPC, start with the basics and work your way up.

** What is Slurm?
Slurm (Simple Linux Utility for Resource Management) is an open-source job scheduler and workload manager designed for Linux clusters. It manages the allocation of resources (e.g., CPUs, GPUs, memory) across multiple nodes in a cluster, ensuring efficient use of hardware for compute-intensive tasks.

*** Key Features of Slurm
- *Job Scheduling*: Queues and schedules jobs based on priorities, resource availability, and user limits.
- *Resource Allocation*: Handles requests for specific hardware like GPUs, which is crucial for AI training.
- *Fault Tolerance*: Manages node failures and job restarts.
- *Scalability*: Supports clusters from a few nodes to thousands, making it ideal for distributed AI training (e.g., data parallelism or model parallelism).
- *Plugins and Extensibility*: Integrates with tools like MPI for multi-node jobs.

Slurm is widely used in supercomputing centers (e.g., on the Top500 list) and is free under the GPL license. It's maintained by SchedMD.

*** Why Use Slurm for AI Training?
AI models, especially large language models or computer vision tasks, require significant computational resources. Slurm allows you to:
- Request multiple GPUs across nodes.
- Run jobs non-interactively (batch mode) for long training sessions.
- Monitor and manage resource usage to avoid overloading the cluster.
- Scale training with distributed frameworks like Horovod or PyTorch Distributed.

Without Slurm, you'd manually manage resources, which is inefficient on shared clusters.

** Getting Started with Slurm
Before using Slurm, ensure you're logged into the cluster via SSH. Slurm commands are run from the terminal.

*** Checking if Slurm is Available
Run ~sinfo~ to view cluster information. If it's not found, Slurm isn't installed or not in your PATH.

Example output:
#+begin_example
PARTITION AVAIL  TIMELIMIT  NODES  STATE NODELIST
gpu          up   infinite      4   idle gpu[1-4]
cpu          up   infinite     10   idle cpu[1-10]
#+end_example

This shows partitions (queues) like "gpu" for GPU jobs.

