docs/Slurm-Config-Use.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-09-27 Sat 21:01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Slurm's Configuration and Usage</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">Slurm's Configuration and Usage</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org893263c">1. Configuration</a></li>
<li><a href="#org9435541">2. Usage</a>
<ul>
<li><a href="#org3eefd40">2.1. Introduction to Slurm for AI Model Training</a></li>
<li><a href="#org14a7d77">2.2. What is Slurm?</a>
<ul>
<li><a href="#org692bf33">2.2.1. Key Features of Slurm</a></li>
<li><a href="#orgcba59f7">2.2.2. Why Use Slurm for AI Training?</a></li>
</ul>
</li>
<li><a href="#org02ddd6a">2.3. Getting Started with Slurm</a>
<ul>
<li><a href="#org695426c">2.3.1. Checking if Slurm is Available</a></li>
<li><a href="#org3e63317">2.3.2. Basic Slurm Concepts</a></li>
</ul>
</li>
<li><a href="#org160c71f">2.4. Basic Slurm Commands</a>
<ul>
<li><a href="#org36e1bae">2.4.1. Viewing Cluster Status</a></li>
<li><a href="#orgc5e26aa">2.4.2. Submitting Jobs</a></li>
<li><a href="#org4e77193">2.4.3. Canceling Jobs</a></li>
<li><a href="#orgfd710fe">2.4.4. Other Useful Commands</a></li>
<li><a href="#org2160ee1">2.4.5. Writing a Slurm Batch Script</a></li>
<li><a href="#org684f83c">2.4.6. Structure of a Slurm Script</a></li>
<li><a href="#org492ba58">2.4.7. Key #SBATCH Directives for AI Training</a></li>
<li><a href="#org2f8c63b">2.4.8. Submitting and Monitoring</a></li>
</ul>
</li>
<li><a href="#org90c26a5">2.5. AI-Specific Usage: Training Models with Slurm</a>
<ul>
<li><a href="#orgad77390">2.5.1. Single-Node Multi-GPU Training</a></li>
<li><a href="#orgc8c9bce">2.5.2. Multi-Node Distributed Training</a></li>
<li><a href="#org99b5354">2.5.3. Environment Setup</a></li>
<li><a href="#org419b28e">2.5.4. Handling Data</a></li>
</ul>
</li>
<li><a href="#orgc869de5">2.6. Monitoring and Debugging Jobs</a></li>
<li><a href="#org7115521">2.7. Advanced Features</a>
<ul>
<li><a href="#orgc844507">2.7.1. Job Dependencies</a></li>
<li><a href="#org2eebf2b">2.7.2. Job Arrays for Parameter Sweeps</a></li>
<li><a href="#org7ec992d">2.7.3. Reservations and Priorities</a></li>
<li><a href="#org68e9dc4">2.7.4. Slurm with Containers</a></li>
</ul>
</li>
<li><a href="#orgf4ed2b8">2.8. Common Pitfalls and Tips</a></li>
<li><a href="#org5a6b6d1">2.9. Conclusion</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org893263c" class="outline-2">
<h2 id="org893263c"><span class="section-number-2">1.</span> Configuration</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sh">
<span style="color: #565575;">## </span><span style="color: #96a0aa;">1. Install
</span>sudo apt install -y munge libmunge-dev gcc make perl <span style="color: #ffe9aa; font-style: italic;">\</span>
sqlite3 libsqlite3-dev libssl-dev

sudo apt install -y slurm-wlm slurm-wlm-doc

slurmd --version   

<span style="color: #565575;">## </span><span style="color: #96a0aa;">2. Config Munge
</span><span style="color: #565575;"># </span><span style="color: #96a0aa;">gen key
</span>sudo /usr/sbin/create-munge-key -r
sudo chown munge:munge /etc/munge/munge.key
sudo chmod 400 /etc/munge/munge.key
sudo systemctl enable --now munge

<span style="color: #565575;">## </span><span style="color: #96a0aa;">3. Config slurm.conf
</span>sudo mkdir -p /etc/slurm
sudo vim /etc/slurm/slurm.conf
</pre>
</div>

<p>
Add the configuration of slurm.conf:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #565575;"># </span><span style="color: #96a0aa;">===GLOBAL ===
</span><span style="color: #ffe9aa;">ClusterName</span>=gs14
<span style="color: #ffe9aa;">ControlMachine</span>=gs14
<span style="color: #ffe9aa;">MpiDefault</span>=none
<span style="color: #565575;"># </span><span style="color: #96a0aa;">=== NODES DEF===
</span><span style="color: #ffe9aa;">NodeName</span>=gs14 <span style="color: #ffe9aa;">CPUs</span>=192 <span style="color: #ffe9aa;">Boards</span>=1 <span style="color: #ffe9aa;">SocketsPerBoard</span>=2 <span style="color: #ffe9aa;">CoresPerSocket</span>=48 <span style="color: #ffe9aa;">ThreadsPerCore</span>=2 <span style="color: #ffe9aa;">RealMemory</span>=501000 <span style="color: #ffe9aa;">Gres</span>=gpu:6 <span style="color: #ffe9aa;">State</span>=UNKNOWN
<span style="color: #565575;"># </span><span style="color: #96a0aa;">===QUEUE===
</span><span style="color: #ffe9aa;">PartitionName</span>=gpu <span style="color: #ffe9aa;">Nodes</span>=gs14 <span style="color: #ffe9aa;">Default</span>=YES <span style="color: #ffe9aa;">MaxTime</span>=7-00:00:00 <span style="color: #ffe9aa;">State</span>=UP
<span style="color: #565575;"># </span><span style="color: #96a0aa;">=== ACCOUNT==
</span><span style="color: #ffe9aa;">AccountingStorageType</span>=accounting_storage/none
<span style="color: #ffe9aa;">SelectType</span>=select/cons_res
<span style="color: #ffe9aa;">SelectTypeParameters</span>=CR_Core_Memory
<span style="color: #ffe9aa;">TaskPlugin</span>=task/none
<span style="color: #ffe9aa;">ProctrackType</span>=proctrack/linuxproc
<span style="color: #ffe9aa;">GresTypes</span>=gpu
</pre>
</div>

<p>
Add the conf for GPU resources:
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo vim /etc/slurm/gres.conf
</pre>
</div>

<p>
fill in:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ffe9aa;">NodeName</span>=gs14 <span style="color: #ffe9aa;">Name</span>=gpu <span style="color: #ffe9aa;">File</span>=/dev/nvidia0
<span style="color: #ffe9aa;">NodeName</span>=gs14 <span style="color: #ffe9aa;">Name</span>=gpu <span style="color: #ffe9aa;">File</span>=/dev/nvidia1
<span style="color: #ffe9aa;">NodeName</span>=gs14 <span style="color: #ffe9aa;">Name</span>=gpu <span style="color: #ffe9aa;">File</span>=/dev/nvidia2
<span style="color: #ffe9aa;">NodeName</span>=gs14 <span style="color: #ffe9aa;">Name</span>=gpu <span style="color: #ffe9aa;">File</span>=/dev/nvidia3
<span style="color: #ffe9aa;">NodeName</span>=gs14 <span style="color: #ffe9aa;">Name</span>=gpu <span style="color: #ffe9aa;">File</span>=/dev/nvidia4
<span style="color: #ffe9aa;">NodeName</span>=gs14 <span style="color: #ffe9aa;">Name</span>=gpu <span style="color: #ffe9aa;">File</span>=/dev/nvidia5
</pre>
</div>
<p>
Restart Service:
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo systemctl enable --now slurmctld
sudo systemctl enable --now slurmd
sinfo
</pre>
</div>
</div>
</div>
<div id="outline-container-org9435541" class="outline-2">
<h2 id="org9435541"><span class="section-number-2">2.</span> Usage</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3eefd40" class="outline-3">
<h3 id="org3eefd40"><span class="section-number-3">2.1.</span> Introduction to Slurm for AI Model Training</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This document provides a comprehensive guide to Slurm, a popular workload manager used in high-performance computing (HPC) environments. It is particularly useful for training AI models on clusters with multiple nodes and GPUs. We'll cover what Slurm is, its key concepts, basic usage, and advanced features tailored for AI workloads like deep learning training with frameworks such as PyTorch or TensorFlow.
</p>

<p>
The guide assumes you have access to a Linux-based HPC cluster where Slurm is installed (common in universities, research labs, or cloud providers like AWS ParallelCluster). If you're new to HPC, start with the basics and work your way up.
</p>
</div>
</div>
<div id="outline-container-org14a7d77" class="outline-3">
<h3 id="org14a7d77"><span class="section-number-3">2.2.</span> What is Slurm?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Slurm (Simple Linux Utility for Resource Management) is an open-source job scheduler and workload manager designed for Linux clusters. It manages the allocation of resources (e.g., CPUs, GPUs, memory) across multiple nodes in a cluster, ensuring efficient use of hardware for compute-intensive tasks.
</p>
</div>
<div id="outline-container-org692bf33" class="outline-4">
<h4 id="org692bf33"><span class="section-number-4">2.2.1.</span> Key Features of Slurm</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li><b>Job Scheduling</b>: Queues and schedules jobs based on priorities, resource availability, and user limits.</li>
<li><b>Resource Allocation</b>: Handles requests for specific hardware like GPUs, which is crucial for AI training.</li>
<li><b>Fault Tolerance</b>: Manages node failures and job restarts.</li>
<li><b>Scalability</b>: Supports clusters from a few nodes to thousands, making it ideal for distributed AI training (e.g., data parallelism or model parallelism).</li>
<li><b>Plugins and Extensibility</b>: Integrates with tools like MPI for multi-node jobs.</li>
</ul>

<p>
Slurm is widely used in supercomputing centers (e.g., on the Top500 list) and is free under the GPL license. It's maintained by SchedMD.
</p>
</div>
</div>
<div id="outline-container-orgcba59f7" class="outline-4">
<h4 id="orgcba59f7"><span class="section-number-4">2.2.2.</span> Why Use Slurm for AI Training?</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
AI models, especially large language models or computer vision tasks, require significant computational resources. Slurm allows you to:
</p>
<ul class="org-ul">
<li>Request multiple GPUs across nodes.</li>
<li>Run jobs non-interactively (batch mode) for long training sessions.</li>
<li>Monitor and manage resource usage to avoid overloading the cluster.</li>
<li>Scale training with distributed frameworks like Horovod or PyTorch Distributed.</li>
</ul>

<p>
Without Slurm, you'd manually manage resources, which is inefficient on shared clusters.
</p>
</div>
</div>
</div>
<div id="outline-container-org02ddd6a" class="outline-3">
<h3 id="org02ddd6a"><span class="section-number-3">2.3.</span> Getting Started with Slurm</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Before using Slurm, ensure you're logged into the cluster via SSH. Slurm commands are run from the terminal.
</p>
</div>
<div id="outline-container-org695426c" class="outline-4">
<h4 id="org695426c"><span class="section-number-4">2.3.1.</span> Checking if Slurm is Available</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Run <code>sinfo</code> to view cluster information. If it's not found, Slurm isn't installed or not in your PATH.
</p>

<p>
Example output:
</p>
<pre class="example" id="org1508051">
PARTITION AVAIL  TIMELIMIT  NODES  STATE NODELIST
gpu          up   infinite      4   idle gpu[1-4]
cpu          up   infinite     10   idle cpu[1-10]
</pre>

<p>
This shows partitions (queues) like "gpu" for GPU jobs.
</p>
</div>
</div>
