docs/Slurm-Config-Use.html
<div id="outline-container-org3e63317" class="outline-4">
<h4 id="org3e63317"><span class="section-number-4">2.3.2.</span> Basic Slurm Concepts</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li><b>Job</b>: A unit of work, like running a Python script for model training.</li>
<li><b>Partition</b>: A queue where jobs are submitted (e.g., "gpu" for GPU-enabled nodes).</li>
<li><b>Node</b>: A physical or virtual machine in the cluster.</li>
<li><b>Task</b>: A process within a job (e.g., one task per GPU).</li>
<li><b>Allocation</b>: The resources granted to your job (e.g., 2 GPUs for 4 hours).</li>
<li><b>Account and QoS</b>: User groups and quality-of-service levels for fair sharing.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org160c71f" class="outline-3">
<h3 id="org160c71f"><span class="section-number-3">2.4.</span> Basic Slurm Commands</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Slurm provides CLI tools for job management. Here's a quick reference:
</p>
</div>
<div id="outline-container-org36e1bae" class="outline-4">
<h4 id="org36e1bae"><span class="section-number-4">2.4.1.</span> Viewing Cluster Status</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li><code>sinfo</code>: Shows partitions, nodes, and their states.
Example: <code>sinfo -p gpu</code> (view only GPU partition).</li>

<li><code>squeue</code>: Lists running and queued jobs.
Example: <code>squeue -u yourusername</code> (your jobs only).
Output columns: JOBID, PARTITION, NAME, USER, ST (state: R=running, PD=pending), TIME, NODES, NODELIST.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc5e26aa" class="outline-4">
<h4 id="orgc5e26aa"><span class="section-number-4">2.4.2.</span> Submitting Jobs</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
There are two main ways: interactive (<code>srun</code>) for testing, and batch (<code>sbatch</code>) for production.
</p>

<ul class="org-ul">
<li><b>Interactive Job</b>: <code>srun</code>
Useful for quick tests or debugging AI code.
Example: <code>srun --partition=gpu --gres=gpu:1 python train.py</code>
This requests 1 GPU and runs <code>train.py</code> interactively.</li>

<li><b>Batch Job</b>: <code>sbatch</code>
Submit a script for non-interactive execution.
Example: <code>sbatch myslurmscript.slurm</code>
Returns a JOBID for tracking.</li>
</ul>
</div>
</div>
<div id="outline-container-org4e77193" class="outline-4">
<h4 id="org4e77193"><span class="section-number-4">2.4.3.</span> Canceling Jobs</h4>
<div class="outline-text-4" id="text-2-4-3">
<ul class="org-ul">
<li><code>scancel JOBID</code>: Cancel a specific job.
Example: <code>scancel 12345</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgfd710fe" class="outline-4">
<h4 id="orgfd710fe"><span class="section-number-4">2.4.4.</span> Other Useful Commands</h4>
<div class="outline-text-4" id="text-2-4-4">
<ul class="org-ul">
<li><code>sacct</code>: View accounting info for completed jobs (e.g., <code>sacct -j JOBID</code> for CPU/GPU usage).</li>
<li><code>scontrol</code>: Advanced control, like <code>scontrol show job JOBID</code> for details.</li>
<li><code>salloc</code>: Allocate resources for an interactive session (similar to <code>srun</code> but without running a command immediately).</li>
</ul>
</div>
</div>
<div id="outline-container-org2160ee1" class="outline-4">
<h4 id="org2160ee1"><span class="section-number-4">2.4.5.</span> Writing a Slurm Batch Script</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
Batch scripts are shell scripts with #SBATCH directives at the top. These specify resource requests.
</p>
</div>
</div>
<div id="outline-container-org684f83c" class="outline-4">
<h4 id="org684f83c"><span class="section-number-4">2.4.6.</span> Structure of a Slurm Script</h4>
<div class="outline-text-4" id="text-2-4-6">
<p>
Scripts typically start with <code>#!/bin/bash</code>, followed by #SBATCH lines, then your commands.
</p>

<p>
Example for AI training (save as <code>train.slurm</code>):
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #565575;">#</span><span style="color: #96a0aa;">!/bin/</span><span style="color: #ff8080; font-weight: bold;">bash</span><span style="color: #96a0aa;">
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --job-name=AI_Training     # Job name
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --partition=gpu            # Partition (queue)
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --nodes=1                  # Number of nodes
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --ntasks=1                 # Number of tasks (processes)
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --cpus-per-task=4          # CPUs per task
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --gres=gpu:2               # GPUs per node (e.g., 2 GPUs)
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --mem=16G                  # Memory per node
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --time=04:00:00            # Time limit (HH:MM:SS)
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --output=train_%j.out      # Stdout file (%j = JOBID)
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --error=train_%j.err       # Stderr file
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --mail-type=END,FAIL       # Email notifications
</span><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --mail-user=your@email.com # Your email
</span>
<span style="color: #565575;"># </span><span style="color: #96a0aa;">Load environment (e.g., modules for Python/PyTorch)
</span>module load python/3.10
module load cuda/11.8
module load pytorch/2.0

<span style="color: #565575;"># </span><span style="color: #96a0aa;">Activate virtual environment if needed
</span><span style="color: #c991e1;">source</span> ~/venv/bin/activate

<span style="color: #565575;"># </span><span style="color: #96a0aa;">Run your AI training script
</span>python train_model.py --epochs 50 --batch-size 32

<span style="color: #565575;"># </span><span style="color: #96a0aa;">Optional: Post-processing
</span><span style="color: #c991e1;">echo</span> <span style="color: #ffe9aa; font-style: italic;">"Training complete!"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org492ba58" class="outline-4">
<h4 id="org492ba58"><span class="section-number-4">2.4.7.</span> Key #SBATCH Directives for AI Training</h4>
<div class="outline-text-4" id="text-2-4-7">
<ul class="org-ul">
<li><b>&#x2013;gres=gpu:N</b>: Request N GPUs per node. Check available with <code>sinfo</code>.</li>
<li><b>&#x2013;nodes=M</b>: For multi-node training (e.g., distributed data parallel).</li>
<li><b>&#x2013;ntasks-per-node=K</b>: Tasks (e.g., one per GPU).</li>
<li><b>&#x2013;time</b>: Max runtime; jobs are killed if exceeded.</li>
<li><b>&#x2013;mem</b>: Total memory; use &#x2013;mem-per-cpu for per-CPU.</li>
<li><b>&#x2013;account</b>: If your cluster uses accounts for billing.</li>
<li><b>&#x2013;constraint</b>: Specify hardware features, e.g., &#x2013;constraint="volta" for GPU type.</li>
</ul>

<p>
For AI, ensure your script handles GPU visibility (e.g., via CUDA_VISIBLE_DEVICES, but Slurm sets it automatically with &#x2013;gres).
</p>
</div>
</div>
<div id="outline-container-org2f8c63b" class="outline-4">
<h4 id="org2f8c63b"><span class="section-number-4">2.4.8.</span> Submitting and Monitoring</h4>
<div class="outline-text-4" id="text-2-4-8">
<ul class="org-ul">
<li>Submit: <code>sbatch train.slurm</code></li>
<li>Monitor: <code>squeue -j JOBID</code></li>
<li>View logs: Check <code>train_JOBID.out</code> and <code>.err</code> files.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org90c26a5" class="outline-3">
<h3 id="org90c26a5"><span class="section-number-3">2.5.</span> AI-Specific Usage: Training Models with Slurm</h3>
<div class="outline-text-3" id="text-2-5">
<p>
AI training often involves GPUs and parallelism.
</p>
</div>
<div id="outline-container-orgad77390" class="outline-4">
<h4 id="orgad77390"><span class="section-number-4">2.5.1.</span> Single-Node Multi-GPU Training</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
Use <code>--gres=gpu:4</code> for 4 GPUs. In PyTorch, use <code>torch.nn.DataParallel</code> or <code>DistributedDataParallel</code>.
</p>

<p>
Example addition to script:
</p>
<div class="org-src-container">
<pre class="src src-bash">srun python train.py --num_gpus 4
</pre>
</div>
<p>
(Use <code>srun</code> inside batch scripts for MPI-like launching.)
</p>
</div>
</div>
<div id="outline-container-orgc8c9bce" class="outline-4">
<h4 id="orgc8c9bce"><span class="section-number-4">2.5.2.</span> Multi-Node Distributed Training</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
For large models:
</p>
<ul class="org-ul">
<li>Request <code>--nodes=2 --ntasks-per-node=1 --gres=gpu:4</code> (8 GPUs total).</li>
<li>Use MPI or PyTorch DDP.</li>
<li>Launch with <code>srun --mpi=pmix python train.py</code> (assuming MPI module loaded).</li>
</ul>
</div>
</div>
<div id="outline-container-org99b5354" class="outline-4">
<h4 id="org99b5354"><span class="section-number-4">2.5.3.</span> Environment Setup</h4>
<div class="outline-text-4" id="text-2-5-3">
<ul class="org-ul">
<li>Use modules: <code>module load</code> for software like CUDA, PyTorch.</li>
<li>Containers: Slurm supports Singularity/Apptainer for Docker-like images.
Example: <code>srun singularity exec --nv myimage.sif python train.py</code> (&#x2013;nv for GPU).</li>
</ul>
</div>
</div>
<div id="outline-container-org419b28e" class="outline-4">
<h4 id="org419b28e"><span class="section-number-4">2.5.4.</span> Handling Data</h4>
<div class="outline-text-4" id="text-2-5-4">
<ul class="org-ul">
<li>Mount shared storage (e.g., /scratch) for datasets.</li>
<li>Use <code>--chdir=/path/to/data</code> to set working directory.</li>
</ul>
</div>
</div>
</div>
