orgs/Slurm-Config-Use.org
** Monitoring and Debugging Jobs
- *Real-Time Monitoring*: ~sstat JOBID~ for resource usage (CPU, memory, GPU).
- *GPU Usage*: Install nvidia-smi and run it in your script: ~nvidia-smi > gpu_usage.log~.
- *Debugging*: Use ~--verbose~ in scripts or interactive ~srun~ for tests.
- *Job Arrays*: For hyperparameter tuning.
  Example: ~#SBATCH --array=1-10~
  Run: ~python train.py --seed $SLURM_ARRAY_TASK_ID~

** Advanced Features
*** Job Dependencies
- Submit dependent jobs: ~sbatch --dependency=afterok:JOBID nextjob.slurm~

*** Job Arrays for Parameter Sweeps
Ideal for AI hyperparameter search.
Example script:
#+begin_src bash
#SBATCH --array=0-9
PARAMS=(0.001 0.01 0.1 ...)  # Array of learning rates
python train.py --lr ${PARAMS[$SLURM_ARRAY_TASK_ID]}
#+end_src

*** Reservations and Priorities
- Check with ~sacctmgr~ or admin for QoS.
- Fairshare: Jobs from heavy users may have lower priority.

*** Slurm with Containers
For reproducible AI environments:
- Build a Singularity image from Docker: ~singularity build myimage.sif docker://pytorch/pytorch~
- Run: ~sbatch~ with ~singularity exec --nv~.

** Common Pitfalls and Tips
- *Over-requesting Resources*: Request only what you need to avoid queue delays.
- *Time Limits*: Estimate runtime; use checkpoints in AI code (e.g., PyTorch save/resume).
- *GPU Compatibility*: Ensure your code matches CUDA version.
- *Error Handling*: Check logs for OOM (out-of-memory) errors; reduce batch size.
- *Best Practices*: Use version control for scripts; document experiments.
- *Learning More*: Read official docs at https://slurm.schedmd.com/. Use ~man sbatch~ for command help.

** Conclusion
Slurm streamlines AI training on clusters by managing resources efficiently. Start with simple batch scripts, then scale to distributed setups. Practice on small jobs to avoid wasting allocations. If you encounter issues, consult your cluster admin or Slurm mailing lists. Happy training!






