docs/Slurm-Config-Use.html
<div id="outline-container-orgc869de5" class="outline-3">
<h3 id="orgc869de5"><span class="section-number-3">2.6.</span> Monitoring and Debugging Jobs</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li><b>Real-Time Monitoring</b>: <code>sstat JOBID</code> for resource usage (CPU, memory, GPU).</li>
<li><b>GPU Usage</b>: Install nvidia-smi and run it in your script: <code>nvidia-smi &gt; gpu_usage.log</code>.</li>
<li><b>Debugging</b>: Use <code>--verbose</code> in scripts or interactive <code>srun</code> for tests.</li>
<li><b>Job Arrays</b>: For hyperparameter tuning.
Example: <code>#SBATCH --array=1-10</code>
Run: <code>python train.py --seed $SLURM_ARRAY_TASK_ID</code></li>
</ul>
</div>
</div>
<div id="outline-container-org7115521" class="outline-3">
<h3 id="org7115521"><span class="section-number-3">2.7.</span> Advanced Features</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-orgc844507" class="outline-4">
<h4 id="orgc844507"><span class="section-number-4">2.7.1.</span> Job Dependencies</h4>
<div class="outline-text-4" id="text-2-7-1">
<ul class="org-ul">
<li>Submit dependent jobs: <code>sbatch --dependency=afterok:JOBID nextjob.slurm</code></li>
</ul>
</div>
</div>
<div id="outline-container-org2eebf2b" class="outline-4">
<h4 id="org2eebf2b"><span class="section-number-4">2.7.2.</span> Job Arrays for Parameter Sweeps</h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
Ideal for AI hyperparameter search.
Example script:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #565575;">#</span><span style="color: #96a0aa;">SBATCH --array=0-9
</span><span style="color: #ffe9aa;">PARAMS</span>=<span style="color: #c66; font-weight: bold;">(</span>0.001 0.01 0.1 ...<span style="color: #c66; font-weight: bold;">)</span>  <span style="color: #565575;"># </span><span style="color: #96a0aa;">Array of learning rates
</span>python train.py --lr $<span style="color: #c66; font-weight: bold;">{</span><span style="color: #ffe9aa;">PARAMS</span><span style="color: #6c6; font-weight: bold;">[</span>$<span style="color: #ffe9aa;">SLURM_ARRAY_TASK_ID</span><span style="color: #6c6; font-weight: bold;">]</span><span style="color: #c66; font-weight: bold;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7ec992d" class="outline-4">
<h4 id="org7ec992d"><span class="section-number-4">2.7.3.</span> Reservations and Priorities</h4>
<div class="outline-text-4" id="text-2-7-3">
<ul class="org-ul">
<li>Check with <code>sacctmgr</code> or admin for QoS.</li>
<li>Fairshare: Jobs from heavy users may have lower priority.</li>
</ul>
</div>
</div>
<div id="outline-container-org68e9dc4" class="outline-4">
<h4 id="org68e9dc4"><span class="section-number-4">2.7.4.</span> Slurm with Containers</h4>
<div class="outline-text-4" id="text-2-7-4">
<p>
For reproducible AI environments:
</p>
<ul class="org-ul">
<li>Build a Singularity image from Docker: <code>singularity build myimage.sif docker://pytorch/pytorch</code></li>
<li>Run: <code>sbatch</code> with <code>singularity exec --nv</code>.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf4ed2b8" class="outline-3">
<h3 id="orgf4ed2b8"><span class="section-number-3">2.8.</span> Common Pitfalls and Tips</h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li><b>Over-requesting Resources</b>: Request only what you need to avoid queue delays.</li>
<li><b>Time Limits</b>: Estimate runtime; use checkpoints in AI code (e.g., PyTorch save/resume).</li>
<li><b>GPU Compatibility</b>: Ensure your code matches CUDA version.</li>
<li><b>Error Handling</b>: Check logs for OOM (out-of-memory) errors; reduce batch size.</li>
<li><b>Best Practices</b>: Use version control for scripts; document experiments.</li>
<li><b>Learning More</b>: Read official docs at <a href="https://slurm.schedmd.com/">https://slurm.schedmd.com/</a>. Use <code>man sbatch</code> for command help.</li>
</ul>
</div>
</div>
<div id="outline-container-org5a6b6d1" class="outline-3">
<h3 id="org5a6b6d1"><span class="section-number-3">2.9.</span> Conclusion</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Slurm streamlines AI training on clusters by managing resources efficiently. Start with simple batch scripts, then scale to distributed setups. Practice on small jobs to avoid wasting allocations. If you encounter issues, consult your cluster admin or Slurm mailing lists. Happy training!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: Zi Liang (<a href="mailto:zi1415926.liang@connect.polyu.hk">zi1415926.liang@connect.polyu.hk</a>)</span> <span class="date">Create Date: Wed Sep  3 16:34:48 2025</span> <span class="date">Last modified: 2025-09-27 Sat 19:50</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</span> </div>
</div>
</body>
</html>
